[{title: 'My Favorite Murder with Karen Kilgariff and Georgia Hardstark',genre: 'Comedy',description: 'Lifelong fans of true crime stories Karen Kilgariff and Georgia Hardstark tell each other their favorite tales of murder and hear hometown crime stories from friends and fans.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/95773.jpg'},{title: 'The Joe Rogan Experience',genre: 'Comedy',description: 'From comedian, UFC commentator and TV host, Joe Rogan. "The Joe Rogan Experience" is a long form, in-depth conversation with the best guests from the comedy world, the sports world, the science world and everything between. One of the most popular comedy podcasts, this show has something for everyone. Available on demand in Stitchers Comedy station.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/13180.jpg'},{title: 'True Crime Garage',genre: 'Society & Culture',description: 'Each week Nic & The Captain get in the garage and talk true crime and drink beer.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/77951.jpg'},{title: 'The Daily',genre: 'News & Politics',description: 'This is what the news should sound like. The biggest stories of our time, told by the best journalists in the world. Hosted by Michael Barbaro. Twenty minutes a day, five days a week, ready by 6 a.m.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/129650.jpg'},{title: 'The Rachel Maddow Show',genre: 'News & Politics	',description: 'Take MSNBCs popular Rachel Maddow Show with you on the go. Listen to full episodes of the television show on demand daily. The MSNBC podcast takes an intelligent and thought provoking look at politics, pop culture, and top news. Hosted by political commentator Rachel Maddow.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/6602.jpg'},{title: 'This American Life',genre: 'Society & Culture',description: 'From WBEZ Chicago Public Radio, This American Life podcast gives listeners touching, humorous and often unexpected vignettes of life in America. Hosted by Ira Glass, these weekly short stories are an on demand version of the popular radio show and available in Stitchers Society & Culture station. Consistently ranked #1 Podcast in the US. New episodes available on Mondays.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/4903.jpg'},{title: 'Sword and Scale',genre: 'Society & Culture',description: 'The Sword and Scale true-crime podcast is an immersive audio experience covering the dark side of humanity and human nature. Our stories delve into the worst of the worst and include murder, rape, dismemberment and cannibalism. No crime is too brutal and no victim is too pure. The worst monsters are real.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/41744.jpg'},{title: 'Last Podcast On The Left',genre: 'Pop Culture, TV & Film',description: 'The Last Podcast On The Left covers all the horrors our world has to offer both imagined and real, from demons and slashers to cults and serial killers, The Last Podcast is guaranteed to satisfy your blood lust.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/39219.jpg'},{title: 'Radiolab',genre: 'Science & Medicine',description: 'Inspiring curiosity. Each episode of the Radiolab podcast is a patchwork of people, sounds, stories, society and experiences. Hosted by Jad Abumrad and Robert Krulwich, Radiolab is produced & made available on demand by WNYC public radio.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/5459.jpg'},{title: 'Pod Save America',genre: 'News & Politics',description: 'Four former aides to President Obama — Jon Favreau, Dan Pfeiffer, Jon Lovett, and Tommy Vietor — are joined by journalists, politicians, comedians, and activists for a freewheeling conversation about politics, the press and the challenges posed by the Trump presidency.',img_url: 'https://secureimg.stitcher.com/feedimagesplain328/127661.jpg'}]